#Задание 1
#a = int(input("Введитете делимое"))
#b = int(input("Ведите делитель"))
#if b ==10:
#    print("На 0 делить нельзя!")
#S =a/b
#print("Результат",S)

#Задание 2
#p=float(input())
#d=.35
#t=20
#f=p-p*d if p>t else p
#print(f'{f:.2f}')

#Задание 3 Урок 2
#Напишите скрипт, который по введенному пользователем числу от 1 до 12,
#a = int(input("Введитете число"))
#if a == 1 or a == 2 or a == 12:
#    print("Зима")
#    elif a ==1:
#        print("Январь")
#    elif a ==2:
#        print("Февраль")
#    elif a == 12:
#        print("Декабрь")
